Repetição de comando
    - repita a ação x vezes

In [2]:
alunos = ['andre','bruna','carol','eduardo','marcela','pedro']
for aluno in alunos:
    print(aluno)

andre
bruna
carol
eduardo
marcela
pedro

In [3]:
for aluno in alunos:
    aluno_id = '123_'+aluno
    print(aluno_id)

123_andre
123_bruna
123_carol
123_eduardo
123_marcela
123_pedro

In [5]:
ids = []

for aluno in alunos:
    aluno_id = '123_'+aluno
    ids.append(aluno_id)

ids

['123_andre',
 '123_bruna',
 '123_carol',
 '123_eduardo',
 '123_marcela',
 '123_pedro']

In [6]:
for aluno in sorted(alunos):
    print(aluno)

andre
bruna
carol
eduardo
marcela
pedro

In [7]:
for aluno in reversed(alunos):
    print(aluno)

pedro
marcela
eduardo
carol
bruna
andre

In [8]:
ids = []
for aluno in alunos:
    if aluno[0] in ['a','b','c','d','f','g']:
        aluno_id = '123_'+aluno
    else:
        aluno_id = '789_'+aluno
    ids.append(aluno_id)
    
ids

['123_andre',
 '123_bruna',
 '123_carol',
 '789_eduardo',
 '789_marcela',
 '789_pedro']

In [10]:
notas = [95, 85, 50, 55, 79, 35]
reprovados = 0
aprovados = 0

for n in notas:
    if n > 60:
        aprovados += 1
    else:
        reprovados += 1
    
print(f'Total de aprovados: {aprovados}\nTotal de reprovados: {reprovados}')

Total de aprovados: 3
Total de reprovados: 3

In [11]:
import pandas as pd
import numpy as np


titanic = pd.read_csv("titanic.csv")
titanic.head()

  Unnamed: 0 pclass  survived     sex          age sibsp parch
0          1    1st  survived  female           29     0     0
1          2    1st  survived    male  0.916700006     1     2
2          3    1st      died  female            2     1     2
3          4    1st      died    male           30     1     2
4          5    1st      died  female           25     1     2

In [28]:
sexo_maior18  = []

for i in range(len(titanic)):
    if titanic.loc[i,'age']>18:
        sexo_maior18 = sexo_maior18.append(titanic.loc[i,"sex"])
sexo_maior18[0:10]

TypeError: '>' not supported between instances of 'str' and 'int'

In [21]:
for i in titanic:
    print(i[2])

n
l
r
x
e
b
r